# LostAcisObjectsOnImport Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..LostAcisObjectsOnImport Property
BuiltInFailures..::..ImportFailures Class See Also
---
Some ACIS objects could not be imported. To import them, use AutoCAD to convert them into polymesh objects and reimport.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LostAcisObjectsOnImport { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LostAcisObjectsOnImport As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LostAcisObjectsOnImport {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace